RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MK51D10/fsl_clock_MK51D10.h
/*!
 * @brief Disable the clock for FLEXCAN module.
 *
 * This function disables the clock for FLEXCAN module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableFlexcanClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for FLEXCAN module.
 *
 * This function will get the clock gate state for FLEXCAN module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetFlexcanGateCmd(uint32_t instance);
#endif

/*!
 * @brief Enable the clock for SPI module.
 *
 * This function enables the clock for SPI module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableSpiClock(uint32_t instance);

/*!
 * @brief Disable the clock for SPI module.
 *
 * This function disables the clock for SPI module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableSpiClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for SPI module.
 *
 * This function will get the clock gate state for SPI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for I2C module.
 *
 * This function enables the clock for I2C module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableI2cClock(uint32_t instance);

/*!
 * @brief Disable the clock for I2C module.
 *
 * This function disables the clock for I2C module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableI2cClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for I2C module.
 *
 * This function will get the clock gate state for I2C module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for UART module.
 *
 * This function enables the clock for UART module.
 * @param instance module device instance
 */
void CLOCK_SYS_EnableUartClock(uint32_t instance);

/*!
 * @brief Disable the clock for UART module.
 *
 * This function disables the clock for UART module.
 * @param instance module device instance
 */
void CLOCK_SYS_DisableUartClock(uint32_t instance);

/*!
 * @brief Get the the clock gate state for UART module.
 *
 * This function will get the clock gate state for UART module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool CLOCK_SYS_GetUartGateCmd(uint32_t instance);

/*!
 * @brief Enable the clock for SDHC module.
 *
 * This function enables the clock for SDHC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableSdhcClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Disable the clock for SDHC module.
 *
 * This function disables the clock for SDHC module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableSdhcClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Get the the clock gate state for SDHC module.
 *
 * This function will get the clock gate state for SDHC module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetSdhcGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateSdhc0);
}

/*!
 * @brief Enable the clock for TSI module.
 *
 * This function enables the clock for TSI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableTsiClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Disable the clock for TSI module.
 *
 * This function disables the clock for TSI module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableTsiClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Get the the clock gate state for TSI module.
 *
 * This function will get the clock gate state for TSI module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetTsiGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateTsi0);
}

/*!
 * @brief Enable the clock for LLWU module.
 *
 * This function enables the clock for LLWU module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_EnableLlwuClock(uint32_t instance)
{
    SIM_HAL_EnableClock(SIM, kSimClockGateLlwu0);
}

/*!
 * @brief Disable the clock for LLWU module.
 *
 * This function disables the clock for LLWU module.
 * @param instance module device instance
 */
static inline void CLOCK_SYS_DisableLlwuClock(uint32_t instance)
{
    SIM_HAL_DisableClock(SIM, kSimClockGateLlwu0);
}

/*!
 * @brief Get the the clock gate state for LLWU module.
 *
 * This function will get the clock gate state for LLWU module.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
static inline bool CLOCK_SYS_GetLlwuGateCmd(uint32_t instance)
{
    return SIM_HAL_GetGateCmd(SIM, kSimClockGateLlwu0);
}

#if FSL_FEATURE_SOC_ENET_COUNT
/*!
 * @brief Set the ENET external clock frequency(ENET_1588_CLKIN).
 *
 * This function sets the ENET external clock frequency (ENET_1588_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequency value.
 */
static inline void CLOCK_SYS_SetEnetExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < ENET_EXT_CLK_COUNT);

    g_enet1588ClkInFreq[srcInstance] = freq;
}
#endif

/*!
 * @brief Set the SDHC external clock frequency(SDHC_CLKIN).
 *
 * This function sets the SDHC external clock frequency (SDHC_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequency value.
 */
static inline void CLOCK_SYS_SetSdhcExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < SDHC_EXT_CLK_COUNT);

    g_sdhcClkInFreq[srcInstance] = freq;
}

#if FSL_FEATURE_SOC_USB_COUNT
/*!
 * @brief Set the USB external clock frequency(USB_CLKIN).
 *
 * This function sets the USB external clock frequency (USB_CLKIN).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequency value.
 */
static inline void CLOCK_SYS_SetUsbExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < USB_EXT_CLK_COUNT);

    g_usbClkInFreq[srcInstance] = freq;
}
#endif

/*!
 * @brief Set the FTM external clock frequency(FTM_CLKx).
 *
 * This function sets the FTM external clock frequency (FTM_CLKx).
 *
 * @param  srcInstance External source instance.
 * @param  freq        Frequency value.
 */
static inline void CLOCK_SYS_SetFtmExternalFreq(uint32_t srcInstance, uint32_t freq)
{
    assert(srcInstance < FTM_EXT_CLK_COUNT);

    g_ftmClkFreq[srcInstance] = freq;
}

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_CLOCK_K51D10_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

